; domain
(define 

	(domain sokoban)
	
	(:requirements :adl)

	(:predicates
		(box ?x)
		(player ?x)
		(horizontal ?x ?y)
		(vertical ?x ?y)
	)
	
	(:action go
		:parameters (?from ?to)
		:precondition
		(and
			(player ?from)
			(or
				(horizontal ?from ?to)
				(vertical ?from ?to)
				(horizontal ?to ?from)
				(vertical ?to ?from)
			)
			(not (box ?to))
		)
		:effect
		(and 
			(player ?to)
			(not (player ?from))
		)
	)

	(:action push
		:parameters (?from ?to ?topaczka)
		:precondition
		(and
			(player ?from)
			(box ?to)
			(not (box ?topaczka))
			(not (= ?from ?to))
			(not (= ?from ?topaczka))
			(not (= ?to ?topaczka))
			(or
				(and
					(or 
						(horizontal ?from ?to)
						(horizontal ?to ?from)
					)
					(or
						(horizontal ?to ?topaczka)
						(horizontal ?topaczka ?to)
					)
					(not
						(or
							(horizontal ?from ?topaczka)
							(horizontal ?topaczka ?from)
						)
					)
				)
				(and
					(or 
						(vertical ?from ?to)
						(vertical ?to ?from)
					)
					(or
						(vertical ?to ?topaczka)
						(vertical ?topaczka ?to)
					)
					(not
						(or
							(vertical ?from ?topaczka)
							(vertical ?topaczka ?from)
						)
					)
				)
			)
		)
		:effect
		(and 
			(player ?to)
			(not (player ?from))
			(box ?topaczka)
			(not (box ?to))
		)
	)
)

; problem
(define (problem image_problem)
(:domain sokoban)
(:objects
f_1_1 f_3_1 f_4_1 f_5_1 f_6_1 f_1_2 f_5_2 f_6_2 f_1_3 f_3_3 f_4_3 f_5_3 f_1_4 f_2_4 f_3_4 f_4_4 f_5_4 f_6_4 f_1_5 f_3_5 f_4_5 f_5_5 f_6_5 f_1_6 f_2_6 f_3_6 f_4_6 f_5_6 f_6_6 )
(:init
(box f_1_2 )
(player f_1_3 )
(box f_4_3 )
(box f_5_3 )
(box f_1_4 )
(box f_6_5 )
(vertical f_1_3 f_1_2)
(vertical f_1_2 f_1_1)
(vertical f_1_1 f_1_2)
(vertical f_1_2 f_1_3)
(vertical f_1_3 f_1_4)
(vertical f_1_4 f_1_3)
(horizontal f_1_4 f_2_4)
(horizontal f_2_4 f_3_4)
(vertical f_3_4 f_3_3)
(horizontal f_3_3 f_4_3)
(horizontal f_4_3 f_5_3)
(vertical f_5_3 f_5_2)
(vertical f_5_2 f_5_1)
(horizontal f_5_1 f_6_1)
(vertical f_6_1 f_6_2)
(vertical f_6_2 f_6_1)
(horizontal f_6_2 f_5_2)
(horizontal f_6_1 f_5_1)
(vertical f_5_1 f_5_2)
(horizontal f_5_1 f_4_1)
(horizontal f_4_1 f_5_1)
(horizontal f_4_1 f_3_1)
(horizontal f_3_1 f_4_1)
(horizontal f_5_2 f_6_2)
(vertical f_5_2 f_5_3)
(vertical f_5_3 f_5_4)
(vertical f_5_4 f_5_3)
(horizontal f_5_4 f_6_4)
(vertical f_6_4 f_6_5)
(vertical f_6_5 f_6_4)
(vertical f_6_5 f_6_6)
(vertical f_6_6 f_6_5)
(horizontal f_6_6 f_5_6)
(vertical f_5_6 f_5_5)
(vertical f_5_5 f_5_4)
(horizontal f_5_5 f_6_5)
(vertical f_5_5 f_5_6)
(horizontal f_5_5 f_4_5)
(vertical f_4_5 f_4_4)
(vertical f_4_4 f_4_3)
(horizontal f_4_4 f_5_4)
(vertical f_4_4 f_4_5)
(horizontal f_4_4 f_3_4)
(horizontal f_4_5 f_5_5)
(vertical f_4_5 f_4_6)
(vertical f_4_6 f_4_5)
(horizontal f_4_6 f_5_6)
(horizontal f_4_6 f_3_6)
(vertical f_3_6 f_3_5)
(vertical f_3_5 f_3_4)
(horizontal f_3_5 f_4_5)
(vertical f_3_5 f_3_6)
(horizontal f_3_6 f_4_6)
(horizontal f_3_6 f_2_6)
(horizontal f_2_6 f_3_6)
(horizontal f_2_6 f_1_6)
(vertical f_1_6 f_1_5)
(vertical f_1_5 f_1_4)
(vertical f_1_5 f_1_6)
(horizontal f_1_6 f_2_6)
(horizontal f_4_5 f_3_5)
(horizontal f_5_6 f_6_6)
(horizontal f_5_6 f_4_6)
(horizontal f_6_5 f_5_5)
(horizontal f_6_4 f_5_4)
(vertical f_5_4 f_5_5)
(horizontal f_5_4 f_4_4)
(horizontal f_5_3 f_4_3)
(vertical f_4_3 f_4_4)
(horizontal f_4_3 f_3_3)
(vertical f_3_3 f_3_4)
(horizontal f_3_4 f_4_4)
(vertical f_3_4 f_3_5)
(horizontal f_3_4 f_2_4)
(horizontal f_2_4 f_1_4)
(vertical f_1_4 f_1_5)
)
(:goal
(and
(box f_1_1 )
(box f_3_1 )
(box f_3_3 )
(box f_1_6 )
(box f_6_6 )
)
)
)

; plan
1. (push f_1_3 f_1_2 f_1_1)
   deleted: (player f_1_3) (box f_1_2)
   added: (player f_1_2) (box f_1_1)
   goals met: 1 of 5
2. (go f_1_2 f_1_3)
   deleted: (player f_1_2)
   added: (player f_1_3)
   goals met: 1 of 5
3. (push f_1_3 f_1_4 f_1_5)
   deleted: (player f_1_3) (box f_1_4)
   added: (player f_1_4) (box f_1_5)
   goals met: 1 of 5
4. (push f_1_4 f_1_5 f_1_6)
   deleted: (player f_1_4) (box f_1_5)
   added: (player f_1_5) (box f_1_6)
   goals met: 2 of 5
5. (go f_1_5 f_1_4)
   deleted: (player f_1_5)
   added: (player f_1_4)
   goals met: 2 of 5
6. (go f_1_4 f_2_4)
   deleted: (player f_1_4)
   added: (player f_2_4)
   goals met: 2 of 5
7. (go f_2_4 f_3_4)
   deleted: (player f_2_4)
   added: (player f_3_4)
   goals met: 2 of 5
8. (go f_3_4 f_4_4)
   deleted: (player f_3_4)
   added: (player f_4_4)
   goals met: 2 of 5
9. (go f_4_4 f_5_4)
   deleted: (player f_4_4)
   added: (player f_5_4)
   goals met: 2 of 5
10. (push f_5_4 f_5_3 f_5_2)
   deleted: (player f_5_4) (box f_5_3)
   added: (player f_5_3) (box f_5_2)
   goals met: 2 of 5
11. (push f_5_3 f_4_3 f_3_3)
   deleted: (player f_5_3) (box f_4_3)
   added: (player f_4_3) (box f_3_3)
   goals met: 3 of 5
12. (go f_4_3 f_4_4)
   deleted: (player f_4_3)
   added: (player f_4_4)
   goals met: 3 of 5
13. (go f_4_4 f_5_4)
   deleted: (player f_4_4)
   added: (player f_5_4)
   goals met: 3 of 5
14. (go f_5_4 f_6_4)
   deleted: (player f_5_4)
   added: (player f_6_4)
   goals met: 3 of 5
15. (push f_6_4 f_6_5 f_6_6)
   deleted: (player f_6_4) (box f_6_5)
   added: (player f_6_5) (box f_6_6)
   goals met: 4 of 5
16. (go f_6_5 f_5_5)
   deleted: (player f_6_5)
   added: (player f_5_5)
   goals met: 4 of 5
17. (go f_5_5 f_5_4)
   deleted: (player f_5_5)
   added: (player f_5_4)
   goals met: 4 of 5
18. (go f_5_4 f_5_3)
   deleted: (player f_5_4)
   added: (player f_5_3)
   goals met: 4 of 5
19. (push f_5_3 f_5_2 f_5_1)
   deleted: (player f_5_3) (box f_5_2)
   added: (player f_5_2) (box f_5_1)
   goals met: 4 of 5
20. (go f_5_2 f_6_2)
   deleted: (player f_5_2)
   added: (player f_6_2)
   goals met: 4 of 5
21. (go f_6_2 f_6_1)
   deleted: (player f_6_2)
   added: (player f_6_1)
   goals met: 4 of 5
22. (push f_6_1 f_5_1 f_4_1)
   deleted: (player f_6_1) (box f_5_1)
   added: (player f_5_1) (box f_4_1)
   goals met: 4 of 5
23. (push f_5_1 f_4_1 f_3_1)
   deleted: (player f_5_1) (box f_4_1)
   added: (player f_4_1) (box f_3_1)
   goals met: 5 of 5
